app/views/pages/explore.html.erb

                    <div class="col-sm-1">
                        <a href="/user/<%= User.find(@p.user_id).username %>"><img src="/avatar.jpg" class="rounded-img" height="50px" width="50px" ></img>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]