app/views/pages/home.html.erb

                        <div class="col-sm-6" style="font-size: 80%; opacity: 0.7;">POSTS</div><br>
                            <h6 style="color: red; font-size: 200%;"><%= current_user.posts.count %></h6>
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]

                    <div class="col-sm-1">
                        <a href="/user/<%= User.find(@p.user_id).username %>"><img src="/avatar.jpg" class="rounded-img" height="50px" width="50px" ></img>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]