app/views/pages/profile.html.erb

                    <div class="col-sm-1">
                        <a href="/user/<%= User.find(@p.user_id).username %>"><img src="/avatar.jpg" class="rounded-img" height="50px" width="50px" ></img>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "Tekli"]]

                    <div class="col-sm-11">
                        <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> <span class="post-creation"></a> - <%= @p.created_at.to_formatted_s(:short) %></span></p>
---
SELECT "posts".* FROM "posts" WHERE (user_id = 3)  ORDER BY "posts"."created_at" DESC